# XMLSAXEndDoc

## Description
Write XML using SAX, end of a document.  XMLSAXBeginDocFile begins a document.

```pascal
FUNCTION XMLSAXEndDoc(XMLHandle : LONGINT): INTEGER;
```

```python
def vs.XMLSAXEndDoc(XMLHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT|   |

## Examples
XMLSAXBeginDocFile.

```pascal
resultN := XMLSAXEndDoc(1);
```
```python
import vs

# Write XML using SAX, end of a document.
XMLHandle = 1

resultN = vs.XMLSAXEndDoc(XMLHandle)
vs.Message('XMLSAXEndDoc returned: ' + str(resultN))
```

## See Also
InitXML | ReleaseXML

XMLSAXBeginDocFile | XMLSAXBeginNode | XMLSAXEndNode | XMLSAXAddNodeAttr | XMLSAXAddNodeValue

## Version
Availability: from Vectorworks 2011

## Category
* XML SAX